In [2]:
import pandas as pd

In [3]:
df1 = pd.read_csv("/Users/alina/Downloads/YNDX_150101_151231.csv")
df1.head()

     <DATE>  <TIME>  <OPEN>  <HIGH>   <LOW>  <CLOSE>  <VOL>
0  20150105  100100  1064.0  1064.0  1064.0   1064.0      0
1  20150105  100200  1064.0  1064.0  1064.0   1064.0      0
2  20150105  100300  1064.0  1064.0  1064.0   1064.0      0
3  20150105  100400  1064.0  1064.0  1064.0   1064.0      0
4  20150105  100500  1064.0  1064.0  1064.0   1064.0      0

In [4]:
df2 = pd.read_csv("/Users/alina/Downloads/YNDX_160101_161231.csv")
df2.head()

     <DATE>  <TIME>  <OPEN>  <HIGH>   <LOW>  <CLOSE>  <VOL>
0  20160104  100100  1148.9  1148.9  1148.9   1148.9      0
1  20160104  100200  1148.9  1148.9  1148.9   1148.9     50
2  20160104  100300  1149.0  1149.0  1149.0   1149.0     33
3  20160104  100400  1149.0  1149.0  1149.0   1149.0      4
4  20160104  100500  1153.0  1153.0  1153.0   1153.0      0

In [5]:
# Возможно совершить максимум одну транзакцию покупки-продажи
df = pd.concat([df1, df2])

In [6]:
df = df.drop(['<HIGH>', '<CLOSE>', '<LOW>', '<VOL>'], axis=1)
df

          <DATE>  <TIME>  <OPEN>
0       20150105  100100  1064.0
1       20150105  100200  1064.0
2       20150105  100300  1064.0
3       20150105  100400  1064.0
4       20150105  100500  1064.0
...          ...     ...     ...
131537  20161230  183800  1244.0
131538  20161230  183900  1248.5
131539  20161230  184000  1248.5
131540  20161230  184600  1247.5
131541  20161230  184900  1247.5

[262108 rows x 3 columns]

In [7]:
df = df.rename(columns={'<DATE>':'Date', '<TIME>' : 'Time', '<OPEN>' : 'Price'})

In [8]:
df_min = df[df['Price'] == min(df['Price'])]
df_min

           Date    Time  Price
96092  20150929  100500  687.0
96093  20150929  100600  687.0
96149  20150929  110200  687.0
96151  20150929  110400  687.0
96173  20150929  112600  687.0
96174  20150929  112700  687.0
96175  20150929  112800  687.0
96176  20150929  112900  687.0
96177  20150929  113000  687.0
96182  20150929  113500  687.0

In [9]:
df_max = df[df['Price'] == max(df['Price'])]
df_max

           Date    Time   Price
73993  20160728  163400  1536.5

In [1]:
print(1536.5 - 687)

849.5

In [10]:
max_i, min_i = 0, 0 
lst = list(df.Price)
for i in range(1, len(lst)): 
    if lst[i] > lst[max_i]: 
        max_i = i 
    if lst[i] < lst[min_i]: 
        min_i = i 
    profit = lst[max_i] - lst[min_i] 
print(min_i, max_i, profit)

96092 204559 849.5

In [11]:
print(len(lst))

262108

Возможно совершить до двух транзакций покупки-продажи, но нельзя накапливать акции в портфеле, то есть каждый раз перед покупкой вы должны сначала продать все имеющиеся акции.

In [11]:
min1, max1, min2, max2 = 0, 0, 0, 0
max_sum = 0

In [32]:
lstp = [123, 124, 148, 567, 78, 67]
lstp[0:2]
#lstp[2:len(lstp)]

[123, 124]

In [34]:
lst1 = lst[0:2]

In [24]:
from random import random
x = 0
while x < 1:
    x += random()
print(x)

1.1395282274129424

In [27]:
from random import random
x = 0
counter = 0
while x < 1: 
    counter += 1
    print('trial: {}, x: {}'.format(counter, x))    
    x += random()

trial: 1, x: 0
trial: 2, x: 0.05387495417869692
trial: 3, x: 0.5681148414701424

Возможно совершить до K транзакций, но нельзя накапливать акции в портфеле, то есть каждый раз перед покупкой вы должны сначала продать все имеющиеся акции. Капитал, передаваемый в ваше распоряжение, вводится с клавиатуры.